'''
Створіть API для системи повідомлень, яка включає відправлення електронних листів та логування дій користувачів, використовуючи фонові завдання для оптимізації продуктивності.

1. Ендпоінт для Відправлення Електронних Листів:
Приймає дані користувача та текст листа.
Використовує фонове завдання для асинхронної відправки листа.
Повертає відповідь, що запит на відправлення листа прийнято.

2. Логування Дій Користувачів:
Під час кожної операції (наприклад, відправлення листа), дії користувача мають бути залоговані.
Логер має записувати дату, час, тип операції та інформацію про користувача.

3. Фонові Завдання для Обробки Великих Файлів:
Розробіть ендпоінт для завантаження файлів.
Використайте фонові завдання для асинхронної обробки завантажених файлів (зміна розміру зображень).


4. Організація Черги Фонових Завдань:
Налаштуйте систему для обробки черги фонових завдань.
Забезпечте моніторинг стану та відслідковування помилок у фонових процесах.
Напишіть тести для перевірки коректності відправлення електронних листів і логування (pytest).
'''

